[
  {
    "title": "Budget 2026 marries IMF discipline to cautious relief, but tax design and wage politics test credibility",
    "body": "The 2026 Budget keeps Sri Lanka on the rails of its IMF (International Monetary Fund) programme: a primary surplus, tighter public investment choices and a pivot to digital tax administration. The move to lower the VAT (Value-Added Tax) registration threshold to Rs. 36 million broadens the net, while the continued 2.5% SSCL (Social Security Contribution Levy) alongside VAT risks double‑taxing the same base and squeezing SMEs’ cashflow. A headline pledge to lift plantation workers’ take‑home pay via a Rs. 200/day state-funded attendance incentive has run into a legal challenge—critics argue the Treasury cannot subsidise private-sector wages. Debt arithmetic remains tight, even as authorities say future ISB (International Sovereign Bond) service is “manageable”. The test now is execution: clean tax design, lawful wage support, and project selection that protects scarce fiscal space."
  },
  {
    "title": "Corporate profits recover as stability returns, but demand is patchy and capital markets remain thin",
    "body": "Big listed groups reported stronger earnings—Dialog Axiata’s EBITDA rose 40% YTD, Hayleys kept profit growth, Aitken Spence lifted PBT 42%, and banks such as BOC and Sampath posted double‑digit PAT gains—signalling cost control and easing macro stress. Yet textile exporter Teejay flagged weak global demand, and CSE liquidity stayed soft despite JF Packaging’s strong IPO debut. Sentiment improved after SriLankan Airlines struck a deal to restructure its defaulted bonds, but turnover remains brittle. This is a “normalisation without exuberance”: profitability is up, volumes and investment still lag."
  },
  {
    "title": "SOE reform and PPPs will be judged by the first deals—not by policy speeches",
    "body": "The new PPP (public‑private partnership) law and CEB unbundling are necessary, but investors will price Sri Lanka on project quality, risk sharing and delivery. Deloitte’s Asia team warned that exchange‑rate risk and under‑prepared pipelines deter capital; ticket sizes under $50–100m will struggle to attract long‑term funds. India’s experience—MOUs with performance targets, listed SOEs paying steady dividends—shows reform credibility compels capital. Sri Lanka’s early PPPs must come with bankable feasibility, fair risk allocation and transparent procurement, or private finance will wait on the sidelines."
  },
  {
    "title": "Gulf and regional ties deepen: councils, flights and forums rebuild the external engine ✈️",
    "body": "Sri Lanka launched the Sri Lanka–Saudi Arabia Business Council; hosted a Luxembourg investment seminar; and co‑convened a Korea–Sri Lanka investment forum to fix bottlenecks. Oman invited Sri Lankan capital into logistics, tourism and manufacturing under Vision 2040, while Belavia’s Minsk–Mattala route broadens air links. Vietnam’s embassy probed opportunities in the Northern Province. These are small but cumulative steps to diversify partners and services—tourism, education, ICT and light manufacturing—beyond slow‑moving merchandise exports."
  },
  {
    "title": "Digital rails are being laid—from Google Pay to shrimp-farm data—but equity and upkeep will decide outcomes",
    "body": "Commercial Bank became the first to enable Google Pay with Visa tokenisation; FAO and the Fisheries Ministry launched SIIS, a farm‑to‑regulator shrimp aquaculture platform using IoT/AI; and Dialog showcased 5G use‑cases at INFOTEL. These are the right pipes for a modern economy. But as experts reminded, devices, teacher training, maintenance and rural connectivity determine whether platforms lift productivity or become stranded assets. The same governance lesson applies elsewhere: instead of curbing the RTI (Right to Information) Act, strengthening the Information Commission’s staffing and budgets would protect transparency gains."
  },
  {
    "title": "Tourism’s next chapter must prioritise higher-yield niches, not raw volume",
    "body": "With arrivals rebounding, industry voices argued for ‘niche excellence’ over mass marketing: hiking (Pekoe Trail), wellness, design and architecture, birding, agro‑experiences, and slow rail can disperse visitors, deepen local spend and protect carrying capacity. New air links help, but success hinges on basics—waste and water systems, signage, trail stewardship, trained guides—and careful storytelling that filters for intent, not just clicks. In short: shift from beach‑and‑selfie to purpose‑driven trips with higher retention and lower ecological stress."
  },
  {
    "title": "Agri‑industry contradictions: palm oil, poultry feed and estate wages expose policy trade‑offs",
    "body": "A data‑rich case to replace Sri Lanka’s crude palm oil cultivation ban with regulated licensing notes higher yields and lower land/water footprints versus substitutes; meanwhile, a Rs. 25/kg SCL on imported maize keeps feed costs high, hobbling a technologically advanced poultry sector. Both policies depress competitiveness and raise consumer prices. On plantations, wage justice is overdue, but a fiscal workaround via Treasury incentives risks setting precedent without fixing productivity, land use and value‑addition. Coherent agri policy would pair fair wages with yield‑raising investment, smarter trade taxes and environmental safeguards."
  },
  {
    "title": "Carbon markets and the blue economy beckon—but only if measurement and permitting are credible 🌿",
    "body": "The Environment Ministry pitched carbon credits as a $250–300m annual opportunity within a decade, with mangroves, forests and renewables as anchors. Concurrently, academics urged a science‑led ‘blue economy’: PPP‑ready ports and logistics, aquaculture with biosecurity, and a marine research station at Kachchativu to depoliticise fisheries and rebuild stocks. Both agendas demand rigorous baselines, transparent registries, clear user rights and inter‑agency coordination—or they risk becoming slide‑deck aspirations rather than exportable assets."
  },
  {
    "title": "Procurement optics matter: the double‑cab tender and RTI anxiety risk eroding public trust",
    "body": "A plan to procure 1,775 double‑cab pickups has drawn scrutiny over compressed bidding windows and eligibility filters that could limit competition, while civil society warns against amending the RTI law instead of resourcing the Information Commission. For a government elected on integrity and thrift, procurement transparency and openness to scrutiny are as important as macro metrics. Rebuild credibility by publishing tender justifications, timelines and contracts, and by empowering oversight bodies."
  }
]