[
  {
    "title": "Cyclone Ditwah turned a fiscal crisis into a governance stress test",
    "body": "With lives lost, over a million displaced and infrastructure battered, Ditwah exposed a yawning gap between accurate national warnings and local execution: red alerts did not translate into targeted, time‑bound evacuations in landslide belts, and last‑mile risk communication failed. The administration has pivoted from response to recovery, but critics and courts alike have flagged non‑activation of the Disaster Management Plan and weak inter‑agency coordination. The policy lesson is not partisan: Sri Lanka needs an automatic, colour‑coded trigger regime for evacuations, hard redundancy in power–water networks, and district authority to act without Colombo’s clearance. The alternative is serial “managed chaos” every monsoon."
  },
  {
    "title": "International solidarity arrived fast; domestic credibility will decide whether it endures",
    "body": "The week saw a cascade of aid: India’s bridges, engineers and airlift (“Operation Sagar Bandhu”), US INDOPACOM C‑130s and logistics, Japan’s tents and water kits, Australia’s cash for WFP and UNFPA programmes, EU/ECHO and CERF allocations, Germany, Switzerland and Russia’s shipments, Myanmar’s medical cargo, and regional philanthropy (Maldives, Tamil Nadu, Thai and Swiss communities). This early surge buys time, not certainty. The Rebuilding Sri Lanka Fund’s governance—ring‑fenced accounts, public dashboards, independent audit, and clear project pipelines—will determine if grants convert into resilient assets rather than a post‑tsunami replay. Trust, not just tonnage, is the scarcest input."
  },
  {
    "title": "The private sector proved it is a response asset—not a bystander",
    "body": "Telcos restored thousands of sites and fibre backbones, opened free connectivity and field Wi‑Fi; the Banks Association pledged disaster debt relief; exporters, chambers and brands mobilised cash, supplies and data analytics; insurers and tech firms kept claims and cybersecurity training running. These moves underscore a structural point: private balance sheets and logistics can be embedded—ex‑ante—into national contingency plans through pre‑signed MOUs, shared data pipes, and drills. That turns improvisation into orchestration the next time the rain stalls overhead."
  },
  {
    "title": "Budget 2026 now needs a cyclone addendum and a results office",
    "body": "Parliament passed the Budget framed pre‑Ditwah; the macro now shifts. A one‑off reconstruction envelope of 3–5% of GDP must be prioritised without unravelling IMF anchors. A National Budget Performance and Evaluation Office—as proposed by academics—would track outputs (bridges reopened, schools restored, landslide buffers built) and outcomes (travel times, school attendance, disaster losses) with monthly dashboards. In a cash‑tight recovery, evidence, not applause lines, should decide which rupee moves first."
  },
  {
    "title": "From welfare to resilience: target climate finance, not blank cheques",
    "body": "UNDP and others argue the Colombo–Gampaha corridor’s submerged assets make Sri Lanka a textbook case for adaptation finance. That requires shovel‑ready, bankable pipelines: river training and floodplain restoration, ‘sponge city’ drainage, hill‑slope stabilisation, climate‑smart agriculture, and hospital–school hardening. Green taxation—pricing pollution, rationalising plastic and congestion, with revenues earmarked for visible resilience—can both nudge behaviour and co‑finance projects. Done transparently, it attracts concessional dollars; done opaquely, it deters them."
  },
  {
    "title": "Disaster law must protect children as aggressively as assets",
    "body": "With 275,000+ children affected and shelters stretched, the NCPA warned against predatory “care offers” and activated the 1929 helpline, while UNFPA flagged rising GBV risks in crowded centres. The response needs child‑centred protocols—ID and reunification systems, safe spaces, school‑in‑shelter kits, cash transfers for guardians, and psychosocial support—alongside hard works. Protecting the vulnerable is not a post‑script to engineering; it is a core recovery metric."
  },
  {
    "title": "Tourism must manage perception as much as debris",
    "body": "Data show a 10–20‑day hesitation window in global searches post‑disaster, not a collapse. The fix is real‑time, credible reassurance: sector‑wide fact packs, live accessibility maps, and traveller‑generated content answering the only question that matters—“Is Sri Lanka safe now?”—in the places AI chatbots scrape (Reddit, YouTube, X). The tea trade’s rapid return to auction cadence and wildlife/cultural sites reopening are proof points. Silence cedes the narrative; coordinated digital voice reclaims it."
  },
  {
    "title": "Power sector reform stayed on the rails—now build climate into the grid plan",
    "body": "ADB approved the next $100m tranche to unbundle the CEB, enable competitive renewables, and clean up balance sheets—crucial to lower tariffs over time. Ditwah’s outages showed single‑point failures (e.g., transmission towers) can darken whole districts and knock out water plants. The updated least‑cost plan must price climate risk: redundancy in critical corridors, distributed generation, storage, and clear private‑sector interconnection rules. Reform that ignores resilience will be penny wise, pound foolish."
  },
  {
    "title": "The return of microfinance regulation risks missing the point—again",
    "body": "A revived Microfinance and Credit Regulatory Authority Bill drew fire for sparing large licensed finance companies while bringing community credit into a heavy compliance net, and for expanding CRIB’s reach without consumer safeguards. Given the debt distress history, a tiered regime makes sense: cap effective interest rates, ban seizure of social transfers, limit multiple loans, and exempt small mutuals from big‑bank rules while enforcing fair‑collection codes across the board. Regulating the innocent while ignoring the systemic is policy theatre."
  },
  {
    "title": "VAT and governance reforms should not be parked for the weather",
    "body": "Standardising VAT invoices from 2026, digitising audit trails, and lowering thresholds will widen the net just as MSMEs struggle to recover. The way through is phased onboarding: free e‑invoicing tools, grace periods, training via chambers, and targeted relief where Ditwah hit hardest. In parallel, organisations must confront fraud‑enabling cultures—hierarchy, silence, and conflicted relationships—that waste resources needed for recovery. Controls that fit local norms work better than imported checklists."
  },
  {
    "title": "Rebuilding must respect topography, not nostalgia",
    "body": "Engineers and ecologists converged on the same prescriptions: enforce no‑build zones on red‑listed slopes and widened river margins, restore riparian buffers and wetlands, remove pine on montane catchments, and adopt ‘sponge landscape’ urban drainage. Where resettlement is unavoidable—especially above 5,000 ft—guarantee land titles, livelihoods access and services, not just walls and roofs. Building back the way we were is a promise to flood again."
  },
  {
    "title": "The diplomatic circuit doubled as an economic one—keep it wired to investment",
    "body": "Visits and forums—from Viet Nam’s trade mission to NASSCOM’s CEO huddle—signal that deal flow can coexist with disaster response. To convert interest into FDI, Sri Lanka must unclog approvals (single‑window at the Port City and BOI), publish a credible pipeline (data centres, logistics, agro‑processing, renewables), and guarantee contract stability. A steady stock market rebound and marquee corporate results help; what seals decisions are predictable rules and serviced land."
  },
  {
    "title": "Bottom line: embed resilience, accountability and speed, or pay compound interest on inaction",
    "body": "Ditwah’s damage bill—3–5% of GDP—arrived on top of debt distress. The only sustainable response is institutional, not ad hoc: early‑warning that triggers action automatically; district command with private‑sector plug‑ins; a climate‑aware grid and water plan; a transparent, audited reconstruction fund; and a results office that publishes monthly progress. Sri Lanka will face more slow‑moving storms; the choice is between rehearsed competence and improvised regret. 🌧️➡️🛠️"
  }
]