[
  {
    "title": "A revived statue controversy and a rainy rally put identity politics back at centre stage",
    "body": "An opposition show-of-force in Nugegoda and an overnight Buddha statue installation in Trincomalee rekindled the combustible mix of religion and politics. The rally boosted Namal Rajapaksa’s profile as a parallel opposition leader, while the statue episode — echoing 2005 — risks turning local land-use disputes into national flashpoints. The government’s calmer response avoided immediate escalation, but the politics are clear: a bid to re-frame the opposition space around Sinhala-Buddhist grievance, complicating the National People’s Power (NPP) government’s effort to keep the conversation on cost of living and reform. The timing is notable: the same week saw outreach to Tamil and Muslim leaders for a more inclusive ‘Sri Lanka Day’, underscoring the country’s split-screen politics."
  },
  {
    "title": "Budget 2026 signals continuity with the IMF — and invites scrutiny on delivery",
    "body": "The 2026 Budget hews to fiscal consolidation, but the devil is in execution. Parliament’s Committee on Public Finance (CoPF) hearings exposed confusion over reserve metrics and a widening gap between appropriations and capital spending. A new Public Finance Management Act caps primary spending at 13% of GDP, limiting room for education to move beyond ~2% of GDP. Meanwhile, Port City law amendments to “encourage” investment via tax tweaks and stronger oversight were cleared for gazetting; they will be judged by whether they attract credible capital rather than regulatory arbitrage. The government’s reform credibility was also tested by frictions with the Right to Information Commission over budgets and independence, and by the criminalisation trend under the Online Safety Act — risks to trust that no primary surplus can paper over."
  },
  {
    "title": "Transport inches toward modernity as a new metro bus model and cashless fares debut",
    "body": "A pilot for card-based bus fare payments launched at Makumbura, with a July 2026 start for a Colombo ‘metro bus’ service run via a distinct entity under SLTB. If executed, the template could thin leakages, simplify VAT and policing of fares, and professionalise the sector. The administration promises separate HR and pay structures — critical to avoid capture by legacy practices. The test will be scale, uptime and whether digital rails (e‑ticketing, open APIs) feed a broader digital public infrastructure, not just a shiny front-end. Done right, this is governance reform disguised as ticketing 🎫."
  },
  {
    "title": "Capital markets and coffers swell, but retail investors still pay the steepest toll",
    "body": "Customs hit record monthly and single‑day collections; tax receipts are on track, and banks and finance companies reported buoyant earnings as credit revives. Yet the Colombo Stock Exchange’s fee architecture — cited at roughly 2.27% round‑trip for small trades — is a structural deterrent to retail participation, while negotiated discounts for large blocks tilt the field. Amendments to Port City’s regime could catalyse listings and structured finance, but investor protection and fee rationalisation will determine whether Sri Lanka builds breadth, not just bursts of turnover. Without that, liquidity remains captive to cycles and crossings, and households keep wealth under the proverbial mattress."
  },
  {
    "title": "Social headwinds mount: a looming teachers’ strike and a spike in cybercrime",
    "body": "Teacher and principal unions threaten a December strike over pay, workload, and top‑down education reforms — a headache for a government that also pledges fiscal restraint. Online, “pig‑butchering” scams — social‑engineering cons fattening victims before fleecing them — spread using deepfakes of national figures. The solution set spans public education, bank alerting, and collaboration with blockchain analytics firms. On digital harms, a UNFPA/UN Women study reported high rates of technology‑facilitated gender‑based violence; tightening the Online Safety Act into a civil‑remedy‑first framework, rather than broad criminalisation of speech, would help. Safety needs law, but trust needs proportion."
  },
  {
    "title": "The green crossroads: from elephant corridors to kilowatt hours to oil palm",
    "body": "A rare environmental win saw Minneriya’s ‘Great Gathering’ of elephants safeguarded after agencies agreed in court to revert to historic reservoir drawdown patterns. Elsewhere, biodiversity advocates and firms marked a decade of restoration partnerships, even as a senior jurist warned that AI’s water and energy appetite will stress fragile grids. In the power sector, the rollback of 2024 unbundling has critics warning of stunted competition; pragmatic fixes — ring‑fenced accounts, transparent dispatch, and reverse auctions for renewables — could still deliver least‑cost capacity. And a push to revisit the oil palm ban, citing updated agronomy and import substitution, pits science‑led plantation policy against old shibboleths. The choice: principled pragmatism, or performative purity 🌱."
  },
  {
    "title": "A farm policy reset beckons: pay for production, not inputs",
    "body": "With rice prices sensitive and import curbs under review, a more durable fix is to shift from fertiliser subsidies to output‑based aid: scan‑and‑pay incentives at point of sale, using QR IDs and IoT‑linked scales. That would reward yield, trim leakages, and generate real‑time stock data for trade policy. SMEs got concessional credit and lower investment thresholds in Budget 2026; pairing that with an export single window and diaspora tie‑ups (a new BELGOLUX–Sri Lanka council launched in Brussels, while a Canada roadshow courted FDI) can turn agriculture and light industry from fiscal cost centres into forex earners. It’s boring plumbing — and exactly what the macro needs."
  },
  {
    "title": "Foreign ties steady as Ottawa is urged to curb LTTE symbolism and Washington reaffirms engagement",
    "body": "Colombo asked Canada to police separatist iconography and messaging; Ottawa reiterated the LTTE’s terrorist listing. The United States reaffirmed cooperation — the US Ambassador met the President and the PM, with nods to education ties (Fulbright, Peace Corps). Europe‑facing business diplomacy gathered pace with the BELGOLUX council launch and private missions to Canada. Meanwhile, domestic governance wrestled with hard trade‑offs — from Port City tax amendments to defence of free expression under the Parliamentary Privileges Act — reminding investors that policy is made where geopolitics, law and politics meet. Acronyms to watch: IMF (International Monetary Fund), RTI (Right to Information), and PPP (public‑private partnership) — each a test of credibility."
  }
]