[
  {
    "title": "Budget 2026 banks on stability while betting big on 7% growth",
    "body": "President Anura Kumara Dissanayake’s four‑hour Budget pitches fiscal discipline under the IMF programme and a medium‑term 7% growth target. Revenue is to rise to 15.3% of GDP and the deficit to narrow to about 5.2%, with digitalisation, trade facilitation and public–private partnerships (PPP) as growth levers. Business lobbies welcomed policy predictability and some long‑sought fixes (trade single window, SOE reform laws, investor visas, 5G rollout). But they also warned the growth maths is thin without faster execution, a clearer investment‑incentive package and stronger tax administration. Critics called the 7% target optimistic, flagged a squeeze on SMEs from a lower VAT registration threshold (Rs. 36m) and queried whether capital spending is sufficient to lift productivity. The Budget’s political economy is now explicit: keep the IMF onside while trying to ease cost‑of‑living pain without derailing consolidation. 📊"
  },
  {
    "title": "Devolution drifts as Provincial Councils remain in limbo",
    "body": "A chorus of actors—the Socialist Alliance, civil-society veterans and Tamil parties—demanded long‑overdue Provincial Council (PC) elections. The Government cites delimitations as the blocker; opponents counter that Parliament (where the NPP holds two‑thirds) could legislate a return to the prior system as an interim step. ITAK (Tamil party) also objected to defence‑sector nominees for the Office of Reparations, arguing it would erode community trust in redress. The longer PCs stay under gubernatorial control, the more devolution looks mothballed—a risk for governance at the periphery and for investor perceptions of predictability beyond Colombo. 🗳️"
  },
  {
    "title": "Governance claims face tests from markets to ministries",
    "body": "The Securities and Exchange Commission (SEC) hauled 150 directors into a plain‑spoken clinic on liabilities and disclosure, underlining new beneficial‑ownership deadlines and solvency tests. Elsewhere, anti‑corruption headlines cut both ways: former Tourism Minister Prasanna Ranatunga was arrested and bailed over an alleged 2021 insurance‑broker deal; and the Opposition hammered the Government over a rushed tender for 1,775 double‑cabs, alleging a 12‑day bid window and tailored specs. The administration’s promise of a cleaner state (and lower perks for officials) will be judged not by rhetoric but by audit trails, prosecutions and tenders that withstand scrutiny. 🕵️"
  },
  {
    "title": "The digital state accelerates, but execution will be decisive",
    "body": "Five Indian firms—including Infosys and TCS—were shortlisted to build Sri Lanka’s MOSIP‑based Unique Digital Identity (SL‑UDI), with first cards slated for Q3 2026 and a local managed‑services handover thereafter. INFOTEL 2025 showcased the $15bn digital‑economy ambition; Global Entrepreneurship Week launched under the rallying cry “Together We Build”; and a home‑grown secure data‑exchange platform (OnsysConnect) won national honours. The prize is big—faster services, cleaner registries and investor confidence—but so are the pitfalls: inter‑agency overlaps, cyber risk and delivery gaps that have stalled reforms before. 💻"
  },
  {
    "title": "Equities rally on Budget cheer as banks and deals take the lead",
    "body": "The Colombo bourse punched past 23,500, buoyed by Fitch’s nod to fiscal consolidation, solid quarterly prints and budget‑friendly signals. DFCC agreed to acquire Standard Chartered’s retail and wealth business; JF Packaging’s IPO was 6.3x oversubscribed; and financials posted muscular results (LOLC Finance H1 PAT up 72% to Rs. 14bn; Seylan’s net profit jumped on loan growth). Yet froth lurks: turnover is flattered by crossings and liquidity is still shallow. Sustaining the rally hinges on passing the PPP/SOE bills, de‑risking debt service beyond 2028, and converting “policies on paper” into shovel‑ready pipelines. 📈"
  },
  {
    "title": "Colombo courts capital while smoothing the diplomacy",
    "body": "The Budget recast Sri Lanka as “a friendly, honest destination” for investors, promising amendments to the Strategic Development Projects and Port City Acts, an Investment Protection Act and a streamlined land‑allocation regime. Colombo Port City’s regulator called it a potential “single catalyst” for growth, from fund management to arbitration—should visas, expat rules and IP processing be simplified. Abroad, Colombo deepened ties: it signed the Hajj 2026 agreement (3,500 quota), launched a Sri Lanka–Saudi business council, invited Pope Leo XIV and secured UNESCO’s annual Vesak day, amplifying soft power without costly concessions. 🌐"
  },
  {
    "title": "Green shoots: biodiversity cash, cleaner waters and climate‑smart pipes",
    "body": "Nature and water management made rare progress. The Kunming Biodiversity Fund approved FAO‑led projects, including Sri Lanka’s plan to tighten biosecurity and invasive‑species control. Cabinet backed four pilot pipeline‑irrigation schemes (877 hectares) with JFPR/ADB support to curb drought losses and promote water‑efficient, higher‑value crops; women’s participation is a stated goal. In Kandy, PM2.5 levels five times the WHO guideline spotlighted enforcement failures from buses to three‑wheelers; and MEPA with Dialog unveiled a 5G‑guided robot that skims floating waste—small tech, big symbolism. India–Sri Lanka legal scholars jointly mapped a cross‑border environmental agenda for the Palk Bay and Gulf of Mannar. 🌿"
  },
  {
    "title": "Tourism returns but talent is the constraint",
    "body": "Arrivals climbed, malls and events buzzed (One Galle Face marked six years with new brands; industry expos drew record crowds), yet the National Human Resource Development Council flagged a severe post‑pandemic labour drain: 60% of hospitality resignations (2020–23) were for overseas jobs. Kitchen, F&B and housekeeping demand is outpacing supply, while women remain under‑represented (24%) due to safety and care burdens. Fixing the skills pipeline—modern curricula, apprenticeships, childcare and safer transport—will matter more for 2026 revenues than destination slogans. 🧳"
  },
  {
    "title": "The arithmetic of cars, credit and wages makes growth tricky",
    "body": "Vehicle‑related lending gulped 63% of finance‑company loans in H1 2025—Rs. 1.16tn—boosting customs revenue but draining FX, pressuring the rupee and crowding out productive credit. A proposed daily wage lift for estate workers (toward Rs. 1,750) addresses hardship but will strain tea‑sector margins unless tied to quality, replanting and branding—TRI marked its centenary warning about ageing bushes and low replanting rates. Meanwhile, Cabinet moved to fold two small housing lenders into BOC and People’s Bank to shore up capital adequacy. Without faster productivity gains, such patch‑ups will not bend the growth curve. 🚗"
  },
  {
    "title": "Security and social cohesion get sharper edges",
    "body": "The Public Security Minister said seven Sri Lankan drug traffickers abroad had agreed to surrender—one sign that the anti‑narcotics drive is reaching into foreign networks. Separately, the President alleged past State funds had bankrolled both Sinhala and Muslim extremists—a grave charge that, if investigated credibly, could reset how Sri Lanka treats violent politics. Hajj logistics, interfaith gestures (UNESCO Vesak, papal invitation) and high‑level Saudi talks point to soft‑power calibration alongside hard‑edged policing. ⚖️"
  }
]