[
  {
    "title": "Sri Lanka’s 2026 Budget cements IMF-style stabilisation but growth bets look stretched",
    "body": "The second NPP Budget keeps faith with hard targets—aiming for a primary surplus of about 2.5% of GDP and total revenue near **15.3–15.4% of GDP**—and doubles down on digitalisation, PPPs and investment facilitation. Markets cheered: the ASPI pushed beyond **23,500**, with turnover repeatedly topping **Rs. 7–8 bn**. Yet a projected **7%** growth path jars with the IMF’s **~3%** outlook and a still-shallow investment pipeline. The state’s capital spend remains modest relative to ambition, and fiscal space will tighten as external debt service ramps up in 2028. The Budget’s pivot to rules-based incentives, a residency visa for investors and amendments to the Strategic Development Projects and Port City Acts is sound; success now hinges on timely execution (single trade window, e-GP, SOE/PPP laws) and not just policy signalling. 📈"
  },
  {
    "title": "Markets rally on ‘stability premium’ while revenue gains carry external risks",
    "body": "Equities extended a November surge—helped by **positive earnings**, Fitch’s nod to fiscal consolidation, and Budget continuity. But part of the revenue overperformance rests on reopened imports (notably vehicles), risking **FX leakage**, rupee pressure (spot **~Rs. 304–305**/$), and higher fuel demand. With **credit growth** skewed to cards, pawning and leases rather than capex, the risk is a consumption-led sugar high. The policy challenge is to convert the stabilisation dividend into exportable capacity—through trade facilitation, para-tariff phase-out, and investment into logistics, services and agri-tech—before global headwinds (e.g., tariff risks on key apparel markets) bite. 🚦"
  },
  {
    "title": "Government moves to de-risk investment climate, but delivery will define credibility",
    "body": "Colombo’s bid to attract quality FDI—via clearer rules, a liaison model, and amendments to the **Port City** and **SDP** regimes—recognises that Sri Lanka’s comparative advantage is regulatory predictability rather than tax giveaways. The National Agency for PPP targets an **early-2026** PPP Act and an Investment Protection Act, while screening tools and procurement rules are being updated. The Ceylon Chamber backed **18** of its proposals in the Budget, but warned the real test is implementation discipline and SOE reform. The Port City Commission’s emphasis on streamlined visas, IP timelines and clarity on global income reporting is pragmatic. Without speed on approvals, investors will default to Dubai/GIFT City playbooks. 🏗️"
  },
  {
    "title": "Governance push widens as SEC drills boards on duties and solvency",
    "body": "The SEC’s workshop for **150+** directors underscored that the Companies Act’s **37 civil** and **131 criminal** liabilities are not theoretical. Directors were urged to read their Articles, police conflicts, and respect solvency tests (s.57) as a ‘golden thread’. The Registrar reminded issuers of **30-day** ultimate beneficial ownership filings for listed firms, and the CSE warned that late, unclear board papers erode oversight. With new delisting rules imposing **3-year** fit-and-proper bans on directors of mandatorily delisted firms, governance is no longer a soft metric. The message: compliance systems matter less than their implementation—and minutes matter. 🧭"
  },
  {
    "title": "Financial sector reshuffle gathers pace as banks and NBFIs chase post-crisis growth",
    "body": "Policy makers approved the absorption of the **HDFC Bank** into BOC and **SMIB** into People’s Bank to stabilise specialised lenders, even as private players posted strong prints: Seylan’s **~40%** YoY profit jump rode **20%+** loan growth; Mahindra Ideal Finance reported **+204%** PBT (**Rs. 477 mn**) with assets up **54%**; hSenidBiz grew revenue **23%** with EBITDA margin up to **11%**; Ambeon’s PAT jumped to **Rs. 3.82 bn**. The CSE’s liquidity is now buoyed by crossings in banks, diversifieds and industrials. The flip side: a rising share of vehicle-backed credit (**>60%** of finance company lending in H1) points to portfolio risk if FX or rates turn. 🏦"
  },
  {
    "title": "Export pivot broadens—trade facilitation and diaspora markets now critical",
    "body": "From Sri Lanka’s pavilion at the **8th CIIE** in Shanghai to a Cambodia investment mission, export agencies are hunting markets beyond the West. Yet logistics reliability remains a constraint—shipping lines have bypassed Colombo over yard and inter-terminal transfer frictions—imperilling apparel just-in-time chains. The Budget’s single window, tariff policy reset and BIA expansion revival are timely; phasing out para-tariffs (e.g., PAL, CESS, SCL) would lower input costs and boost competitiveness. With the apparel sector exposed to tariff volatility, services niches (ICT, arbitration, asset management) via Port City and the diaspora are promising buffers if regulatory plumbing works. 🌏"
  },
  {
    "title": "Rule of law meets realpolitik as high-profile graft and rights debates resurface",
    "body": "The arrest and quick bail of ex-minister **Prasanna Ranatunga** in an alleged **Rs. 4.7 mn** insurance commission case (with travel ban) spotlights prosecutorial momentum and evidentiary rigour—magistrates noted gaps on alleged witness tampering claims. Simultaneously, civil society has flagged delayed **Provincial Council** polls and mooted stop-gap legal fixes (e.g., revert to PR to avoid delimitation gridlock), while clergy challenged a proposed school sex-education curriculum as foreign-driven. The Government’s anti-narcotics drive now targets traffickers abroad (with **seven** willing to surrender). The underlying risk is reform fatigue if governance and rights reform move out of sync with economic measures. ⚖️"
  },
  {
    "title": "Construction and tourism get cautious tailwinds, but private capex must carry the load",
    "body": "The Budget earmarks **Rs. 342 bn** for roads (Central Expressway segments) and **Rs. 91.7 bn** for irrigation, with estate and urban housing continuing. Industry bodies note that private projects—in logistics, industrial parks, hospitality—are now the larger growth engine, with construction’s GDP share seen near **7%** in 2026. Tourism recovery is uneven; policy focus on connectivity, visas and destination marketing must accelerate. With lenders tightening vehicle LTVs and labour shortages persistent, productivity gains—e-procurement, PPPs, project screening—will make or break the cycle. 🏨"
  }
]