[
  {
    "title": "Cyclone Ditwah turned a weather shock into a governance test",
    "body": "With hundreds dead, hundreds more missing and over a million people affected across all 25 districts, Sri Lanka declared a state of emergency as floods and landslides exposed systemic weaknesses. Early warnings were issued, yet evacuation and last‑mile communications lagged; illegal hillside construction and blocked drainage amplified losses. The National Building Research Organisation (NBRO) needs binding powers, the long-delayed National Building Code must be accelerated, and environmental impact assessments enforced. Otherwise the next storm will be a consequence, not an accident 🌧️."
  },
  {
    "title": "Rebuilding needs fast money and slow politics: make the recovery fund legal, transparent and inclusive",
    "body": "Colombo set up a ‘Rebuilding Sri Lanka’ Fund and a Management Committee to channel relief and reconstruction. MPs insist Parliament must authorise it and oversee spending—consistent with the Constitution and the Public Financial Management Act. The all‑male, business‑heavy committee has drawn criticism for lacking disaster, health, gender and community representation. Anchoring governance to the Sendai Framework’s ‘whole‑of‑society’ principle and giving legal teeth to oversight would build trust and curb the risks of past fund misuse. Acronyms watch: Sendai is the UN’s global disaster‑risk blueprint; transparency is the domestic one."
  },
  {
    "title": "India’s SAGAR meets Sri Lanka’s hour of need as neighbours rally",
    "body": "India’s Operation Sagar Bandhu deployed National Disaster Response Force (NDRF) teams, Mi‑17 V5s, Chetak helicopters and the carrier INS Vikrant to winch, evacuate and deliver relief—hard power used for humanitarian assistance and disaster relief (HADR) 🤝. The effort dovetails with the Colombo Security Conclave’s growing regional toolbox. Others followed: the US committed $2m and airlift support; Japan sent an assessment team, emergency goods and a 30‑strong medical unit (via WHO-SEARHEF funds); Australia pledged AUD 1m; Nepal, Maldives, Bangladesh, Pakistan, the UAE and China sent cash and supplies. Diplomacy works best when it is practical."
  },
  {
    "title": "Connectivity and healthcare became lifelines, not luxuries",
    "body": "Telecom outages severed families and responders; operators and vendors scrambled to restore backbone fibre, deploy generators and offer free connectivity. SLT‑Mobitel launched a 247 medical helpline with the University of Colombo; Starlink credited free satellite service through December for affected users. The World Health Organization released $175,000 and backed rapid response teams. The lesson: climate‑proof the health system by integrating meteorological feeds with disease surveillance, and build redundant communications that function under stress. SEARHEF—WHO’s regional emergency fund—helped, but domestic ‘digital fortification’ must now follow 📡."
  },
  {
    "title": "The bill will be big: tourism, farms and imports point to a 1–3% of GDP hit",
    "body": "The disaster struck at peak season, denting arrivals despite reassurances that most sites reopened quickly. Upcountry vegetables, tea estates, roads, bridges and power lines suffered heavy damage, pushing up imports of staples and equipment, widening the trade gap. Market estimates range from $200m to $2.9bn, with the final tally likely at 1–3% of GDP. A national infrastructure bond, debt‑for‑resilience swaps, and targeted support for micro, small and medium enterprises (MSMEs) can soften the blow. Acronyms decoded: MSMEs are the backbone of jobs; IMF conditionality must not crowd out climate adaptation."
  },
  {
    "title": "Markets wobble, then price resilience amid blue finance and bank paper",
    "body": "The Colombo bourse lurched on flood headlines—panic selling one day, bargain hunting the next—while the rupee weakened modestly. Construction, telecoms and banks led turnover; insurers and logistics should brace for claims and capex. Against the gloom, DFCC listed Sri Lanka’s first blue bond to finance ocean‑positive projects, and banks teed up subordinated debentures to fortify capital. Investors are weighing near‑term earnings hits against policy credibility and the speed of reopening. Volatility will persist until damage data firm up 📈."
  },
  {
    "title": "Business and civic muscle filled gaps—but must now match generosity with governance",
    "body": "From Binance Charity’s Rs.61.6m via the Sri Lanka Red Cross Society (SLRCS) to Prima’s Rs.300m in rations, CHEC Port City’s Rs.10m plus heavy machinery on the A5, Cargills’ 10,000 packs, Uber’s Rs.65m package, Avon’s Rs.2m and Dawoodi Bohra’s Rs.10m, private aid flowed fast. Platforms such as PickMe’s AID feature moved donations; telecoms extended zero‑rated services. The ask now: fair pricing of essentials, audited flows through vetted channels, and corporate social responsibility (CSR) that extends beyond glossy reports to climate risk, worker safety and local supply chains. ESG is not a slogan—it’s procurement, logistics and transparency."
  },
  {
    "title": "Politics is waterlogged: competence, accountability and unity are all on trial",
    "body": "President Anura Kumara Dissanayake promised to use emergency powers only for relief, while critics flagged late evacuations and muddled communications—especially in Tamil—and urged a Parliamentary Select Committee on early‑warning lapses. The opposition also demanded that the Rebuilding Fund be brought under parliamentary control. Separately, a smouldering Customs containers scandal resurfaced. The political risk is clear: if oversight and delivery falter, the narrative shifts from ‘natural disaster’ to ‘avoidable loss’. Unity is not optional when reservoirs are spilling."
  },
  {
    "title": "Plan a different rebuild: stop hasty hill‑building and make risk maps binding",
    "body": "The NBRO’s hazard maps long warned against building on unstable slopes, flood plains and blocked drainage corridors, yet exemptions, weak enforcement and political pressure prevailed. Rebuilding should hard‑wire nature‑based solutions, enforce EIAs, and publish hazard data in Sinhala and Tamil. Prioritise safe resettlement, accessible shelters, and services for those who bear the brunt—plantation workers, women (including pregnant women), people with disabilities, LGBTQIA+ communities and informal workers. Tourism messaging must be honest: reopen safely, don’t overpromise ✳️."
  },
  {
    "title": "From rescue to reform: build institutions before the next storm",
    "body": "Sri Lanka’s Disaster Management Centre (DMC), health and irrigation systems functioned under fire, but fragmentation persists. Strengthen the DMC’s mandate, integrate NBRO clearances into all approvals, staff provincial disaster units, and run public drills. Invest in river telemetry, landslide early warning, and district‑level coordination that survives power cuts. Explain the alphabet soup—DMC (Disaster Management Centre), NBRO (National Building Research Organisation), NDRF (India’s National Disaster Response Force), HADR (Humanitarian Assistance and Disaster Relief)—and make it work for citizens. The choice is between rebuilding better or reliving the worst 🔁."
  }
]