[
  {
    "title": "Budget 2026 locks in IMF discipline but leaves growth to chance",
    "body": "Sri Lanka’s second NPP Budget cements continuity with the IMF: a push for a primary surplus, a **deficit of ~5% of GDP** and debt on a glide path to **95% of GDP in 2026**. Markets cheered—equities hit new highs and Fitch lauded the fiscal anchors—but the growth engine remains under‑specified. Critics from across the aisle flagged a revenue “mirage,” as import‑tax windfalls (notably cars) and base‑widening (lowering the VAT threshold to **Rs. 36 m**) risk masking weak tax administration and crowding out productive credit. The Ceylon Chamber welcomed stability yet urged converting fiscal gains into **capex with impact**—ports, logistics, digital, energy, irrigation. The bigger miss: a time‑bound plan to phase out para‑tariffs that keep export costs high. Without sharper execution on reforms, the Budget’s target of **~7% growth** looks more aspirational than programmatic. 📈⚖️"
  },
  {
    "title": "Colombo signals an investor reset: PPP law, investment protection and Port City execution",
    "body": "Policy plumbing is finally catching up with ambition. The Government aims to enact the PPP Act by Q1 2026, roll out a Screening & Scoring tool for projects, and pass an **Investment Protection Act**—tackling years of institutional overlap. At Colombo Port City, the Commission insists the original incentives remain intact and competitive, and rightly pivots from more tax breaks to easier entry: residency/visa rules, expatriate hiring, IP timelines, and clarity on global income filings. The agenda is credible; the challenge is throughput. The SEC’s refresher on directors’ liabilities—reminding boards of **37 civil and 131 criminal exposures**—is a timely nudge that governance, not glossy brochures, will determine whether Sri Lanka captures the next wave of FDI. 🧭🏗️"
  },
  {
    "title": "Private sector profits rebound, but a vehicle‑credit binge clouds the credit mix",
    "body": "Corporate earnings point to a real‑economy thaw: diversified majors like **Ambeon** and **Sunshine** delivered strong half‑year results; tech player **hSenidBiz** neared EBIT break‑even; and **Mahindra Ideal Finance**’s PBT rose **204%**. Yet Licensed Finance Companies issued **Rs. 1.16 trillion** in vehicle‑backed loans in H1—**63% of lending**—a consumption surge that risks depleting FX and squeezing credit to SMEs, exports and manufacturing. Apparel voices welcomed VAT on imported fabrics (a level playing field), while the port and logistics lobby pressed for operational fixes—ITT, yard capacity, and digital pre‑clearance—to keep Colombo on mainline schedules. The signal from the CACCI summit was clear: regional trade is opening; Sri Lanka must simplify, or be bypassed. 🚗💸"
  },
  {
    "title": "The digital state moves from pilots to platforms—if delivery keeps pace",
    "body": "Sri Lanka’s digital stack is taking shape. Five Indian firms have been shortlisted to build the **Unique Digital ID (SL‑UDI)** under the MOSIP framework, with first cards targeted for **Q3 2026** and a local MSP transition plan. Home‑grown platforms like **OnsysConnect** (NBQSA winner) and ecosystem events—INFOTEL 2025, SLASSCOM’s AI Asia Summit—show momentum and talent. But budgets are lean and coordination is hard: real payoff hinges on interoperable registries, e‑payments at zero fees for micro‑transactions, and agencies adopting shared rails rather than bespoke silos. The promise is lower friction and fewer queues; the risk is another showcase without scale. 🖥️🔗"
  },
  {
    "title": "Sex education becomes a political fault line as mental‑health alarms grow",
    "body": "The Archbishop of Colombo warned that a proposed sex‑education curriculum risks importing alien values; the Prime Minister countered that an age‑appropriate module—co‑designed with the Family Health Bureau and NCPA—is essential to protect children amid rising abuse and online harms. The episode exposes a familiar governance gap: parents are primary educators, but they need evidence‑based tools. With studies citing **~60% of schoolchildren showing symptoms of depression** and **24% of seniors significant symptoms**, a curriculum that pairs biology with consent, safety, and dignity—validated by clinicians and educators—would be a public‑health intervention, not social engineering. 🧠🧒🏽"
  },
  {
    "title": "Opposition readies a Nugegoda test, but 2015’s ‘Mahinda wind’ is not in the air",
    "body": "The SLPP and UNP will join a 21 November rally in Nugegoda, evoking the 2015 ‘Mahinda Sulanga’ launchpad; analysts caution the analogy is superficial. Then, a wounded but dominant figure faced a weak government; today, the NPP holds the initiative, markets are calmer, and the Opposition is fragmented. More consequential is the constitutional impasse: Provincial Councils remain in limbo, despite a **Supreme Court view** that Governors cannot indefinitely run provinces. With a two‑thirds majority, the Government could re‑enable PR‑based PC polls by simple amendment; that would cut the Gordian knot—and lower political temperature. 🗳️⚖️"
  },
  {
    "title": "Green shoots in water, air and hospitals point to quiet gains beyond GDP",
    "body": "A **$3.3 m** Japan‑funded programme will pilot piped irrigation across **877 ha** to cut drought losses; Sri Lanka and India launched a law‑and‑policy dialogue on shared marine ecosystems; and firms from banking to testing labs picked up **Presidential Environment Awards**. In health, a Swiss‑backed **Philips Azurion 3M12** angiography unit will **double** capacity at Karapitiya, easing backlogs. A sobering research note warns that atmospheric **oxygen drift** and urban pollutants are a coming threat—making pipeline irrigation, clean energy, and city air‑quality governance less luxury, more necessity. 🌱💧🌬️"
  },
  {
    "title": "Soft power and the Gulf axis deepen: Hajj quota, tourism diplomacy and Vesak at UNESCO",
    "body": "Riyadh and Colombo aligned on tourism and investment at the UNWTO General Assembly; Sri Lanka secured a **Hajj 2026 quota of 3,500** alongside a draft Hajj Act to regularise operations; and UNESCO adopted a Sri Lanka–led resolution to mark the **International Day of Vesak** annually—leveraging faith diplomacy for cultural visibility. Business councils with the Philippines and a trade mission to Cambodia extend ASEAN linkages. The opportunity now is to translate ceremony into seats, routes and spend—tourism marketing, visas, and reliable airlift—not just communiqués. 🕌🛫"
  }
]