[
  {
    "title": "Cyclone Ditwah exposed disaster-preparedness gaps but could yet catalyse a safer rebuild",
    "body": "The storm was less about wind speed than water volume: an estimated 13bn m³ of rain in 24 hours flooded 1.1m hectares, damaged 720,000 buildings and severed key roads and rail. The government invoked the Public Security Ordinance, convened the National Council for Disaster Management, and began compensation and resettlement planning while tasking agencies with a unified data platform and landslide certification. Yet early warnings were uneven, legal frameworks (the Disaster Management Act) proved dated, and building codes and zoning have lagged risk realities. The next phase must hard‑wire risk into development: relocate from geologically unsafe zones, enforce flood‑resilient design, modernise reservoir operations, and embed fit‑for‑purpose early‑warning triggers that translate into automatic, pre‑agreed actions. The prize is twofold: fewer lives disrupted in the next deluge—and lower fiscal costs over time. 🏗️"
  },
  {
    "title": "Aid arrived fast—and from all quarters—underscoring Colombo’s multi‑alignment dividend",
    "body": "Japan deployed a 29‑strong JDR field hospital to Chilaw and pledged $2.5m; the UK funded relief via UNOPS and the Red Cross and backed a $4.5m CERF allocation; India ran medical teams and flew in food and medicine under Operation Sagar Bandhu; Norway added over $2.4m; Médecins Sans Frontières delivered 1,000 winterised tents; and private donors amplified the effort. A Foreign Aid Coordination Committee is being set up to keep flows transparent and targeted. The pattern is familiar: Sri Lanka’s ability to tap Indian, Western and multilateral help simultaneously reflects a foreign policy that works best when it is steady, predictable, and non‑exclusive. 🤝"
  },
  {
    "title": "Recovery finance will test policy nerve: spend smart, keep IMF traction, crowd in capital",
    "body": "A lively debate has re‑opened over fiscal space. One camp argues that a currency‑issuing state can prioritise rupee outlays for relief and reconstruction, with inflation risks managed by supply restoration and import prioritisation. Another stresses hard external constraints and insists on staying the course with the IMF. In practice, the state is doing both: ADB approved $200m to boost water and food security; the Treasury says tax‑to‑GDP has rebounded to about 15.4% and is tracking 16%—key to credibility; and Parliament is being asked to focus on medium‑term reforms even as near‑term cash reaches households. The art now is sequencing—front‑load essential repairs, protect external balances, and lay out a transparent rebuild pipeline that private lenders and donors can co‑finance. 💸"
  },
  {
    "title": "Risk financing and private giving surged; the harder job is to insure and govern the rebuild",
    "body": "Parametric cover for hotels and small tourism firms, long proposed, now looks less optional and more like prudence—payouts triggered by rainfall or wind thresholds can bridge liquidity gaps. Corporates opened wallets—among others, Almas Holdings (Rs. 250m pledged), Indra Traders (Rs. 100m), Lakbima Rice Mills (Rs. 100m), Naturub (Rs. 100m), Sriyani Dress Point (Rs. 20m), Macksons (Rs. 15m), Lanka IOC (Rs. 50m), and many smaller cheques—while diaspora and partner governments sent material aid. Two imperatives follow: publish who‑gets‑what, where; and use the moment to mainstream disaster insurance and resilient standards so that the next shock is fiscally smaller. 🛡️"
  },
  {
    "title": "A single arrest does not equal the rule of law; institutions will be judged by consistency",
    "body": "The police arrested an NPP MP after an accident that injured a child and two women—then drew criticism for delaying an alcohol test. Editorialists have cited other selective enforcement cases (including dropped charges against a senior official) and political interference complaints. Meanwhile, the Supreme Court granted leave in a landmark ragging case and issued sweeping interim orders to 69 respondents, signalling judicial impatience with impunity in universities. The through‑line is clear: if the administration wants to claim a break with the past, process must be even‑handed, fast, and visible—whether on accidents, graft, or campus violence. ⚖️"
  },
  {
    "title": "The economy wobbled but did not buckle; finance and exporters are doing heavy lifting",
    "body": "Equities seesawed as investors weighed cyclone losses against reconstruction upside; construction counters and logistics names outperformed on rebuild hopes, while a primary dealer (WTS) floated an IPO. Banks remain pivotal: industry assets rose to Rs. 24.5trn in 9M 2025, with net loans at Rs. 12.1trn; SME credit leadership stayed with Commercial Bank (Rs. 330.9bn in 2024), and Sampath reported strong earnings and improved asset quality. On the real side, a Ritz‑Carlton Yacht made a maiden dual‑port call, PickMe deepened payments integration, and export champions—from Omega Line to Akbar Brothers and Sysco LABS—swept Presidential Awards. Trade ties with Viet Nam were upgraded, targeting $1bn. The signal: growth will come from services, exports and capex—if policy predictability holds. 📈"
  },
  {
    "title": "Sri Lanka must fix its meteorology and water‑management plumbing before the next storm",
    "body": "A National Audit trail shows a Doppler radar programme launched in 2007 never reached full operation, while a later JICA plan was delayed and scaled to one site; a separate paper urges partnerships with China’s NSMC (Fengyun satellites), India’s IMD and Japan’s JMA for data and modelling. The National Council has ordered a unified data platform and work on fragile‑area maps; engineers are calling for modernised reservoir rule curves and real‑time rainfall‑runoff tools; and researchers are urging rainwater harvesting, urban drainage upgrades and early‑warning protocols that auto‑trigger actions. The media too has been asked to avoid mislabelling multiple systems; accuracy builds public trust. 🌧️🛰️"
  },
  {
    "title": "Geopolitics just got sharper; Colombo’s safest course remains disciplined multi‑alignment",
    "body": "Analysts say Washington’s new National Security Strategy is more transactional, narrows priorities, and leans on India in the Indo‑Pacific. That implies fewer sermons but more asks—on maritime cooperation, supply chains, and predictability of port governance. For Sri Lanka, the playbook is familiar: deepen trust with India (Colombo Security Conclave, fisheries management, transparent port access), keep Chinese, Japanese, ASEAN and Gulf ties economic, and draft an overdue National Security Strategy to guide choices. Trade missions like the Viet Nam meetings show what ‘win‑win’ looks like in practice—rice, logistics, textiles, direct flights. 🧭"
  }
]