[
  {
    "title": "Cyclone Ditwah has morphed from a weather shock into an economic test Sri Lanka cannot afford to fail",
    "body": "With nearly two million people affected and direct physical damage preliminarily estimated at about $4.1 billion (World Bank GRADE), the cyclone is now a macroeconomic event. The ILO reckons up to 374,000 workers are affected and potential monthly earnings losses could reach $48 million, with rice, fisheries and tea hardest hit. The State has mobilised a Rs. 500 billion supplementary estimate and a ‘Rebuilding Sri Lanka’ fund; the BOI has set up a 24/7 support unit to unblock import/export and damaged-goods issues for investors. Success will hinge on more than cash: science-led land-use and early warning (NBRO), landslide mitigation rather than ad‑hoc resettlement, and credible oversight of spend. The prize is stabilising 2025 growth and reducing the country’s structural exposure to climate shocks; the penalty is deeper output losses and a longer recovery. 🌀"
  },
  {
    "title": "India’s fast deployment and a $450 m package reposition New Delhi as Colombo’s first responder",
    "body": "External Affairs Minister S. Jaishankar’s visit underscored India’s role: Operation Sagar Bandhu flew in medicines and rations, an Indian Army field hospital treated patients, and 228 tons of Bailey bridges helped restore connectivity; India also pledged a $450 m recovery package (including a $100 m grant). The symbolism matters—especially as Sri Lanka reassures tourists in peak season. Europe, Japan and Pakistan also extended assistance, while the EU activated its civil protection mechanism to airlift 83 tonnes of relief. In geopolitics, reliability trumps rhetoric; India’s mix of logistics, finance and political signalling met that standard. 🇮🇳🤝"
  },
  {
    "title": "Domestic capital is showing up: corporate Sri Lanka is turning CSR into disaster capital expenditure",
    "body": "Private balance sheets are reinforcing public outlays. Cargills gave Rs. 100 m to the national fund and Rs. 45 m in rations; HNB committed Rs. 100 m and 2,500 relief packs; LOLC launched a three‑phase Rs. 400 m programme, from family ‘super packs’ to rebuilding 200 schools; Sri Lanka Insurance supported 1,000 families; Lion Brewery cleared debris and boats in Biyagama; The Technocity earmarked Rs. 50 m in devices and school infrastructure; Pyramid Wilmar, Tristar UAE, Asriel Marketing and others wrote cheques. The lesson: public–private partnerships (PPPs) can scale relief quickly. The caveat: all flows—corporate and State—must be transparently tracked through the Rebuilding Fund to sustain trust. 💸"
  },
  {
    "title": "Without an Auditor General, post‑cyclone rupees will lack a referee",
    "body": "The Auditor General’s post has been vacant since 7 December. CoPF Chair Harsha de Silva warns the gap disables Parliament’s control over public finance (Articles 148 and 154), blinding COPA and COPE just as reconstruction accelerates. The Government has urged the Constitutional Council to either approve one of the four nominees or explain rejections; the Bar Association also flagged the vacancy. In disaster times, speed is vital—but so are scorekeepers. Filling the post is the single cheapest way to improve the probity of every rupee spent. ⚖️"
  },
  {
    "title": "Sri Lanka must treat landslides as a management problem—not just a humanitarian one",
    "body": "Columns this week highlighted the engineering logic: saturated soils over weak bedrock, adverse bedding planes, and unmanaged drainage make Central Highlands slopes fail. Experts proposed a National Landslide Risk Management Authority, scaled bio‑engineering and sub‑surface drainage, and moving from blanket ‘red zones’ to targeted mitigation at upper catchments. Equally, knee‑jerk bans on construction above altitude lines or relocating entire districts would be disruptive and unscientific; better to follow the evidence‑based National Physical Plan 2050, invest in early warning (in all national languages), and build dry dams and flood bunds where rivers have no reservoirs. 🏔️"
  },
  {
    "title": "Markets and money are edging back, even as risk premia nudge up",
    "body": "The CSE has been volatile—Dockyard’s rights issue overhang hit prices before rebounding on India aid headlines; institutional crossings in blue‑chips kept turnover healthy. Unit trust AUM rose 16.5% YoY to Rs. 597 bn by November, with equity funds seeing fresh inflows and 141,252 investors now in the market. Treasury bill yields ticked up at auction as the Central Bank accepted fewer bids, and the rupee was broadly steady around Rs. 309.5/US$. On the real economy’s digital rails, Dialog commercially launched 5G with 220 live sites, SLT‑MOBITEL opened public 5G access, and NSB rolled out Tap‑and‑Go via Mastercard—small tailwinds for productivity as reconstruction ramps. 📈📡"
  },
  {
    "title": "Policy tweaks signal pragmatism: bait‑fish tariffs, stalled hospitals and urban tenders are back on the table",
    "body": "Cabinet created a dedicated HS code to import milk fish for long‑line tuna bait—restricted to fishing societies—and replaced Wekkaya tariffs with a special trade tax of Rs. 180/kg, with Rs. 130/kg concessions for societies. It also restarted eight hospital projects (A&E units, cardiology and clinic buildings, surgical wards), now estimated at Rs. 16.2 bn vs. Rs. 6.7 bn earlier—an expensive reminder of the cost of delay. The UDA will re‑invite proposals for a prime Fort plot on a 99‑year lease after an empty 2024 tender, and named former JICA specialist M.G. Hemachandra as Chairman—useful signals to investors that the real‑asset pipeline is moving again. 🧱"
  },
  {
    "title": "Hard cases should not make bad laws: security and media rules need restraint, not mission creep",
    "body": "Two red flags appeared. A civil‑society collective warned that the draft Protection of the State from Terrorism Act (PSTA) largely reproduces PTA‑style defects—administrative detention up to two years and overbroad speech offences—risking protest and journalism through vague definitions. Separately, the Editors’ Guild criticised the CID’s summons to a newspaper editor and a Deputy Minister’s remarks inviting police action against ‘defamation’ of the President under emergency rules. Post‑disaster legitimacy relies on open scrutiny, not muscular opacity; keeping emergency powers narrow and the press free is a resilience measure, too. 📰"
  }
]