[
  {
    "title": "Budget 2026 locks in IMF stabilisation but leaves the growth engine idling",
    "body": "President Anura Kumara Dissanayake’s 2026 Budget keeps faith with the IMF’s Extended Fund Facility—aiming at a 2.5% primary surplus, revenue of c.15% of GDP and debt at 95% of GDP in 2026—with investor‑friendly moves such as an Investment Protection Act and clearer incentives. Yet capital spending remains modest and the big accelerators (trade logistics, energy, skills) hinge on delivery. VAT net-widening (threshold down to Rs. 36m from April 2026) and a proposed plantation wage lift to Rs. 1,750/day from January 2026 aid revenue and equity, but execution risks loom. With Provincial Council elections still in limbo, political devolution—and investor confidence it underwrites—also drifts."
  },
  {
    "title": "Markets cheer the Budget as equities hit records, but credit is fuelling a car boom",
    "body": "The CSE’s All‑Share broke through 23,500 on Budget optimism and a Fitch nod to fiscal discipline; turnover stayed brisk. Beneath the rally, Licensed Finance Companies directed about 63% of H1 2025 lending to vehicle‑backed loans, while import outflows for autos exceeded $1.4bn. That props up customs and VAT—📈—but risks pressuring the rupee and crowding out productive credit. Revenue buoyancy built on imported consumption is a short bridge to sustainable growth."
  },
  {
    "title": "Policy plumbing advances: PPP law, Port City tweaks and a national digital ID are queued",
    "body": "The PPP Act is slated for early 2026 with a screening tool by end‑Q1; an Investment Protection Act is being drafted; and amendments to the Strategic Development Projects and Port City laws aim to speed approvals. Port City Colombo is pitched as a regional services hub—including arbitration—if visas, IP registration and expat employment rules are streamlined. The first digital ID cards are targeted for 2026 under the MOSIP framework, with five Indian integrators shortlisted via India’s NISG. The theme is clear: implement, don’t just announce."
  },
  {
    "title": "Exports and SMEs get a policy lift, but the hard yards start at the port gate",
    "body": "Business welcomed Budget nods to a Trade National Single Window, tariff-policy clean‑up and SME support, and CACCI’s Colombo summit cast Sri Lanka as a connector in the ‘Asian Century’. Apparel brands applauded VAT on imported fabrics to level the field. Yet shippers warn that skipped vessel calls at Colombo—due to congestion and slow inter‑terminal transfers—are delaying inputs and export dispatches. To cash policy cheques, Sri Lanka must phase out para‑tariffs, digitise border agencies and fix port operations."
  },
  {
    "title": "Devolution drifts as Nugegoda readies a protest stage and reconciliation stirs",
    "body": "An Opposition-led ‘Maha Jana Handa’ rally is set for 21 November, while the Socialist Alliance demanded overdue Provincial Council elections. ITAK urged the President not to stack the Office of Reparations with security‑sector appointees. The political theatre highlights a deeper risk: prolonged delays in sub‑national polls and transitional justice appointments could chill investor sentiment that the Budget seeks to warm."
  },
  {
    "title": "Tourism diplomacy courts the Gulf as Colombo eyes a services niche",
    "body": "Sri Lanka backed the Riyadh Declaration on the Future of Tourism at the UNWTO Assembly, pitched an investor‑residence visa, and will push destination marketing in 2026. Colombo Port City’s champions tout a cost‑competitive arbitration hub and MICE (meetings, incentives, conferences, exhibitions) potential—if legal and administrative bottlenecks are cleared. The bet is a services‑led 🧭 that complements goods exports."
  },
  {
    "title": "Green shoots: pipeline irrigation pilots and corporate climate action gain traction",
    "body": "Cabinet cleared four pilot pipeline‑irrigation schemes in dry zones—financed by a $3.3m JFPR grant via ADB and Rs. 1.68bn state funds—to cut water losses and boost yields. On the sustainability scoreboard, firms from banking to testing services picked up Presidential Environment Awards, signalling that ESG is nudging into mainstream practice. Small steps, but the climate‑economy link is finally on the policy map."
  },
  {
    "title": "Social policy debates sharpen around welfare, wages and classrooms",
    "body": "The Budget proposes lifting estate wages to Rs. 1,750/day (including a Rs. 200 attendance incentive) from January 2026; business seeks productivity linkages. A minister’s description of the Aswesuma cash grant as ‘legal begging’ sparked pushback, exposing the tightrope between safety nets and work incentives. Sex education returned to the spotlight: the Archbishop criticised plans, while the Prime Minister (who is also Education Minister) said age‑appropriate content would be expert‑led to protect children from abuse."
  },
  {
    "title": "Governance and law‑and‑order remain in focus as reforms and probes gather pace",
    "body": "The SEC briefed over 150 listed‑company directors on duties and liabilities under company law, reinforcing the ‘tone at the top’ in capital markets. Anti‑corruption probes saw a former minister arrested and bailed in an alleged 2021 insurance‑procurement case. On narcotics, seven traffickers abroad signalled willingness to surrender, according to the Public Security Minister, dovetailing with the nationwide ‘Ratama Ekata’ drug‑control drive. Accountability—both corporate and criminal—stayed on the front page."
  }
]